Revit 2027 API
KeynoteTable.GetKeynoteTable Method
 Gets the KeynoteTable from a Revit document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static KeynoteTable GetKeynoteTable(
	Document aDoc
)
Public Shared Function GetKeynoteTable (
	aDoc As Document
) As KeynoteTable
public:
static KeynoteTable^ GetKeynoteTable(
	Document^ aDoc
)
static member GetKeynoteTable :
        aDoc : Document -> KeynoteTable
Parameters
aDoc Document
 The Revit document.
Return Value
KeynoteTable
 The KeynoteTable.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
KeynoteTable Class
Autodesk.Revit.DB Namespace